# Να δημιουργήσετε μια συνάρτηση στη γλώσσα Python που, όταν την καλείτε, να εμφανίζει το άθροισμα τριών αριθμών
# που θα πληκτρολογείτε. Στη συνέχεια να δημιουργήσετε μια νέα συνάρτηση, που θα χρησιμοποιεί την προηγούμενη και που,
# όταν την καλείτε, να υπολογίζει και να εμφανίζει το μέσο όρο των τριών αριθμών που πληκτρολογείτε.

def athroisma():
    ath=0
    a=int(input("Δώσε 1ο αριθμό :"))
    b=int(input("Δώσε 2ο αριθμό :"))
    c=int(input("Δώσε 3ο αριθμό :"))
    ath=a+b+c
    return ath
def mesos_oros(athroisma):
    mo=athroisma/3
    return mo

plus=athroisma()
mo=mesos_oros(plus)
print("Ο μέσος όρος είναι : ",mo) 