# Γράψτε μία συνάρτηση η οποία να ελέγχει αν ένα όνομα τελειώνει σε "ακης" (akis).
# Σε αυτή την περίπτωση η τιμή της θα είναι True, αλλιώς η τιμή της συνάρτησης θα είναι False.
# (β) Βελτιώστε την παραπάνω συνάρτηση ώστε να ελέγχει αν το όνομά μας τελειώνει σε "ακης" (akis),
# "ιδης" (idis), "άκος" (akos) κλπ και να επιστρέφει τον αντίστοιχο πιθανό τόπο καταγωγής.

def elegxos_kataliksis():
    name=input("Δώσε επίθετο : ")
    print(name[-4:])
    if name[-4:]=="άκης":
        tk="ΚΡΗΤΗ"
        return tk
    elif name[-4:]=="άκος":
        tk="ΜΑΝΗ"
        return tk
    elif name[-4:]=="ίδης":
        tk="ΜΑΚΕΔΟΝΙΑ"
        return tk
    
tk=elegxos_kataliksis()
print("Πιθανός τόπος καταγωγηής : ", tk)
        


# Γράψτε μια συνάρτηση με το όνομα vowelCount και όρισμα την ακολουθία χαρακτήρων s η οποία
# να επιστρέφει τον αριθμό των φωνηέντων σε αυτή την ακολουθία χαρακτήρων.

def vowelCount(s):
    tosa=0
    for item in s:
        if item in ("a,e,o,i,u"):
            tosa+=1
    return tosa

s=input("Δώσε ακολουθία χαρακτήρων : ")
tosa=vowelCount(s)
print("Η ακολουθία χαρακτήρων που έδωσες περιέχει : ", tosa , "φωνήεντα")



# Γράψτε μία συνάρτηση η οποία θα διαβάζει μία συμβολοσειρά η οποία περιέχει ονόματα χωρισμένα
# με κόμματα και θα τυπώνει τα ονόματα σε χωριστές γραμμές.
# [Υπόδειξη. Χρησιμποιήστε την μέθοδο split.]


def xorisma():
    words=""
    s=input("Δώσε συμβολοσειρά η οποία περιέχει ονόματα χωρισμένα με κόμματα :")
    words=s.split(",")
    return words
lekseis=xorisma()
for word in lekseis:
    print(word)
