#Να αναπτυχθεί πρόγραµµα σε Python το οποίο:
# α. θα διαβάζει το όνομα ενός μαθητή της Γ' Λυκείου,
# β. τους βαθμούς του στα δυο τετράμηνα και
# γ. τον γραπτό του βαθμό στις πανελλήνιες εξετάσεις
# δ. Να υπολογίζει τον βαθμός πρόσβασης του μαθητή αυτού στο συγκεκριμένο μάθημα
# ε. Να εμφανίζεται το όνομα του μαθητή και ο βαθμός πρόσβασής του
# (Σημείωση: ο βαθμός πρόσβασης υπολογίζεται από την πράξη 70% * γραπτός βαθμός + 30% * προφορικός βαθμός,
# όπου ο προφορικός βαθμός είναι ο μέσος όρος των βαθμών στα δυο τετράμηνα)


name=str(input("Ονοματεπώνυμο μαθητή : "))
t1=int(input("Βαθμός 1ου τετραμήνου : "))
t2=int(input("Βαθμός 2ου τετραμήνου : "))
Exam=int(input("Βαθμός γραπτών εξετάσεων : "))

Grade=0.70*Exam+0.3*(t1+t2)/2

print("Ο μαθητής", name , "έχει βαθμό πρόσβασης" , Grade)