# Γράψτε εντολές οι οποίες ζητούν από το χρήστη να δώσει ένα γράμμα
# και ελέγχουν αν είναι φωνήεν (a, e, i, o, u) ή σύμφωνο, τυπώνοντας
# ταυτόχρονα και ένα κατάλληλο μήνυμα. [Υπόδειξη. Δεν χρειάζεται να
# ελέγξετε αν ο χαρακτήρας που έδωσε ο χρήστης είναι όντως γράμμα.
Letter=input("Δώσε γράμμα : ")
if Letter in ("A","E","O","Ι","U"):
    print("Το γράμμα είναι φωνήεν")
else:
    print("Το γράμμα είναι σύμφωνο")


# Γράψτε ένα πρόγραμμα το οποίο θα βρίσκει και θα τυπώνει τον μέγιστο
# μεταξύ τριών ακεραίων x, y, z..
A=int(input("Δώσε Α : "))
B=int(input("Δώσε B : "))
C=int(input("Δώσε C : "))
if A>B:
    if A>C:
        print( A , "ο μέγιστος")
    else:
        print( C , "ο μέγιστος")
else:
    if B>C:
        print( B , "ο μέγιστος")
    else:
        print( C , "ο μέγιστος")


# Πρόγραμμα που ζητάει έναν ακέραιο αριθμό και εμφανίζει το μήνυμα
# ‘ΖΥΓΟΣ’ ή ‘ΜΟΝΟΣ’ ελέγχοντας αν το υπόλοιπο της ακέραιας διαίρεσης
# είναι 0 ή 1 αντίστοιχα
a=input('Δώσε έναν ακέραιο αριθμό:')
b=a%2
if b==0:
print("ΖΥΓΟΣ")
else:
print("ΜΟΝΟΣ")


# Ένα έτος είναι δίσεκτο αν διαιρείται με το τέσσερα αλλά όχι με το 100,
# με εξαίρεση τα έτη που διαιρούνται με το 400 τα οποία είναι δίσεκτα.
#(Ποιός εισήγαγε τα δίσεκτα έτη και για ποιό λόγο;) Γράψτε ένα πρόγραμμα
# σε python το οποίο να ελέγχει αν ένα έτος είναι δίσεκτο ή όχι.
Year=int(input("Δώσε έτος : "))
if Year%400==0:
    print("Το έτος είναι δίσεκτο")
else:
    if Year%4==0 and Year%100!=0:
        print("Το έτος είναι δίσεκτο")
    else:
        print("Το έτος δεν είναι δίσεκτο")

# Πρόγραμμα που ζητάει το εισόδημα και υπολογίζει και εμφανίζει τον φόρο.
# Αν το εισόδημα είναι από 0 έως 10000 ο φόρος είναι 5%.
# Αν το εισόδημα είναι πάνω από 10000 και έως 30000 ο φόρος είναι 10%
# Αν το εισόδημα είναι πάνω από 30000 ο φόρος είναι 20%
eis=input('Δώσε το εισόδημα:')
if eis<0:
    print('Λάθος εισόδημα')
elif eis<=10000:
    foros=eis*5.0/100
    print('Ο φόρος είναι: ', foros)
elif eis<=30000:
    foros=eis*10.0/100
    print('Ο φόρος είναι: ', foros)
else:
    foros=eis*20.0/100
    print('Ο φόρος είναι: ', foros)