# Παράδειγμα κλάσης

class Vehicle: 
    def __init__( self, color, price, wheels, speed): 
        self.color=color 
        self.price=price 
        self.wheels=wheels 
        self.speed=speed
# Παρατηρούμε ότι οι ιδιότητες της κλάσης εισάγονται σε μια ιδιαίτερη
# συνάρτηση την __init__ ως παράμετροι.

# Η self εμφανίζεται ως πρώτη παράμετρος σε όλες τις μεθόδους 
# της κλάσης (δείτε στην προηγούμενη παράγραφο). Αυτή η παρά-
# μετρος επιτρέπει στη μέθοδο να αναφέρεται στο ίδιο το αντικείμε-
# νο και όχι σε ολόκληρη την κλάση, πράγμα που τουλάχιστον ισχύ-
# ει στη γενική περίπτωση. Τοποθετώντας στη self το όνομα του 
# αντικειμένου, διασφαλίζουμε ότι μια μέθοδος που θα κληθεί μέσω 
# ενός αντικειμένου, θα επιδράσει μόνο σε αυτό.
# Προσοχή!!! Η λέξη self δεν αποτελεί δεσμευμένη λέξη της python
# αλλά μια σύμβαση μεταξύ των προγραμματιστών της γλώσσας. 

# Σημαντικό είναι όταν ορίζουμε κατασκευαστές, να θυμόμαστε ότι 
# κάθε ιδιότητα που χρησιμοποιείται από άλλες μεθόδους, πρέπει 
# να αρχικοποιείται, πριν χρησιμοποιηθεί. Ο πιο εύκολος τρόπος για 
# την αποφυγή λαθών είναι, να ορίζονται όλες μέσα στην__init__, 
# καθώς δεν υπάρχει τρόπος, να πούμε στο πρόγραμμα να τρέξει 
# δύο μεθόδους για αρχικοποίηση.

# Η σωστή πρακτική είναι να δίνουμε αρχική τιμή σε όλες τις ιδιότητες
# των αντικειμένων μιας κλάσης μέσα στην __init__. Η αρχικοποίηση
# των ιδιοτήτων των αντικειμένων έξω από την __init__ αποτελεί
# κακή πρακτική και θα πρέπει να αποφεύγεται.

def accelerate(self, amount) : 
    self.speed += amount 
    return self.speed

# Οι μέθοδοι είναι σημασιολογικά ίδιες με τις συναρτήσεις, αλλά υ
# πάρχουν δύο συντακτικές διαφορές: 
# Οι μέθοδοι ορίζονται μέσα στον ορισμό μιας κλάσης, 
# προκειμένου να γίνει σαφής η σχέση μεταξύ της κλάσης και 
# της μεθόδου. 
# Η σύνταξη για την κλήση μιας μεθόδου είναι διαφορετική 
# από τη σύνταξη για την κλήση μιας συνάρτησης. 
# Ως υπογραφή ορίζεται το όνομα, τα ορίσματα και η τιμή επιστροφής
# της μεθόδου. 



def decelerate(self, amount) : 
    self.speed -= amount 
    return self.speed 


mybeetle = Vehicle('yellow', 2000.00, 4, 80).
# To mybeetle είναι ένα αντικείμενο, ανήκει στην 
# κλάση όχημα (Vehicle) και έχει συγκεκριμένες τιμές για τις ιδιότητες
# του οχήματος, αυτές που ορίσαμε με την κλήση της. Ένα τέτοιο
# αντικείμενο ονομάζεται στιγμιότυπο της κλάσης. 
