#Γράψτε κατάλληλες εντολές για την επεξεργασία της ακολουθίας χαρακτήρων AppliedMathematics. 
#Συγκεκριμένα, γράψτε εντολές οι οποίες τυπώνουν:
    #Τους πρώτους 6 χαρακτήρες.
a="AppliedMathematics"
print(a[:5])
    #Τους τελευταίους 5 χαρακτήρες.
print(a[-5:])
    #Κάθε δεύτερο χαρακτήρα ξεκινώντας από τον τρίτο. Τεμαχισμός (slicing)
print(a[2::2])
    #Όλους τους χαρακτήρες ξεκινώντας από το τέλος και προχωρώντας προς την αρχή.
print(a[::-1])
    #Μια ακολουθία αποτελούμενη από τους χαρακτήρες στις άρτιες θέσεις ακολουθούμενη από τους χαρακτήρες στις περιττές θέσεις.
print(a[0::2]+a[1::2])
