#Έχουμε δύο σημεία στο επίπεδο με συντεταγμένες A(ax,ay), B(bx,by). Γράψτε εντολές ώστε να βρείτε και να τυπώσετε την απόσταση μεταξύ τους.
from math import sqrt
print("Θα χρειαστώ τις συντεταγμένες των δύο σημείων")
print("Δώσε μου τις συντεταγμένες του πρώτου σημείου")
x1=int(input("x1="))
y1=int(input("y1="))
print("Δώσε μου τις συντεταγμένες του δεύτερου σημείου")
x2=int(input("x2="))
y2=int(input("y2="))
Απόσταση=sqrt((y1-y2)**2+(x1-x2)**2)
print("Η απόσταση των δύο σημείων είναι : ", Απόσταση)