# Γράψτε ένα πρόγραμμα, το οποίο διαβάζει επαναληπτικά αριθμούς μέχρι ο χρήστης
# να εισάγει ‘τέλος’. Όταν εισαχθεί ‘τέλος’, εκτυπώνει το άθροισμα, το πλήθος
# και τον μέσο όρο των αριθμών. Εάν ο χρήστης εισάγει οτιδήποτε άλλο εκτός από
# αριθμούς, εντοπίζει το λάθος με χρήση των try και except, εκτυπώνει ένα μήνυμα λάθους
# και ζητά τον επόμενο αριθμό.

άθροισμα=0
πλήθος=0
μέσος_όρος=0

while True:
    try:
        x=input("Δώσε αριθμό : ")
        if x=="τέλος":
            break
        x=int(x)
    except ValueError:
        print("δεν είναι αριθμός")
    else:
        άθροισμα+=x
        πλήθος+=1
        μέσος_όρος=άθροισμα/πλήθος
print("Το άθροισμα είναι ; ", άθροισμα)
print("Το πλήθος των αριθμών είναι ; ", πλήθος)
print("Ο μέσος όρος είναι ; ", μέσος_όρος)






# Γράψτε ένα άλλο πρόγραμμα, το οποίο ζητά μια λίστα αριθμών, όπως και παραπάνω
# και στο τέλος εκτυπώνει το μέγιστο και το ελάχιστο όλων των αριθμών αντί
# για τον μέσο όρο.

metritis=0
μέγιστος=0
ελάχιστος=0
while True:
    try:
        x=input("Δώσε αριθμό : ")
        if x=="τέλος":
            break
        x=int(x)
        if metritis==0:
            μέγιστος=x
            ελάχιστος=x
            metritis+=1
    except ValueError:
        print("δεν είναι αριθμός")
    else:
        if x>μέγιστος:
            μέγιστος=x
        if x<ελάχιστος:
            ελάχιστος=x
print("Ο μέγιστος είναι ο ; ", μέγιστος)
print("Ο ελάχιστος είναι ο ; ", ελάχιστος)



