# Γράψτε μία ανακύκλωση while η οποία θα υπολογίζει τις δυνάμεις του δύο
# έως έναν ανώτατο εκθέτη n ο οποίος θα εισάγεται από τον χρήστη.
a= int(input("Δώσε εκθέτη : "))
metritis=1
ginomeno=2
print(ginomeno)
while metritis!=a:
    ginomeno=ginomeno*2
    print(ginomeno)
    metritis+=1

# Γράψτε μία ανακύκλωση while ώστε να υπολογίσετε την τετραγωνική ρίζα των
# μη αρνητικών ακεραίων μέχρι έναν μέγιστο ακέραιο n ο οποίος θα είσαγεται από τον χρήση.
import math
metritis=1
tr=0
n=int(input("Δώσε μέγιστο ακέραιο : "))
while metritis!=n:
    tr=math.sqrt(metritis)
    metritis+=1
    print(tr)


# Γράψτε μία ανακύκλωση while ώστε να εισάγει ο χρήστης ένα πλήθος αριθμών και το πρόγραμμα θα επιστρέφει το άθροισμά τους.
# (β) Ακολούθως συμπληρώστε το πρόγραμμά σας ώστε να υπολογίζει και τον μέσο όρο τους. (γ) Ακολούθως συμπληρώστε το πρόγραμμά σας
# ώστε να βρίσκει και τον μέγιστο μεταξύ των αριθμών που εισάγει ο χρήστης. Η είσοδος των αριθμών θα πρέπει να τερματίζεται όταν
# ο χρήστης δώσει τον αριθμό μηδέν.

ath=0
a=int(input("δώσε αριθμό : "))
metritis=0
meg=a
while a!=0:
    ath+=a
    metritis+=1
    mo=ath/metritis
    if a>meg:
        meg=a
    a=int(input("δώσε αριθμό : "))
print("Το άθροισμα είναι", ath)
print("Ο μέσος όρος είναι", metritis)
print("ο μέγιστος είναι ο ", meg)


# Γράψτε ένα πρόγραμμα το οποίο θα ζητά από τον χρήστη να καταχωρίσει 10 περιττούς ακεραίους. Το πρόγραμμα θα πρέπει να ελέγχει
# αν ο κάθε εισαγόμενος αριθμός είναι περιττός και θα τερματίζεται η εισαγωγή αριθμών μόνο όταν έχουν εισαχθεί συνολικά δέκα περιττοί.
# Τέλος το πρόγραμμα θα τυπώνει τον μέσο όρο τους. [Υπόδειξη. Δεν χρειάζεται να ελέγχετε αν τα εισαγόμενα δεδομένα είναι ακέραιοι.]
ath=0
sunolo=0
while sunolo!=10:
    a=int(input("Δώσε αριθμό : "))
    if a%2==1:
        sunolo+=1
        ath+=a
print(ath/10)


# Γράψτε ένα πρόγραμμα το οποίο θα ζητά από τον χρήστη να καταχωρίσει 10 θετικούς ακεραίους και μετά θα τυπώνει τον μεγαλύτερο
# περιττό ακέραιο αριθμό που έχει καταχωρηθεί. Αν δεν καταχωρηθεί κανένας περιττός ακέραιος αριθμός, τότε το πρόγραμμα
# θα τυπώνει σχετικό μήνυμα.
meg=0
metritis=0
while metritis!=10:
    a=int(input("Δώσε αριθμό : "))
    metritis+=1
    if a%2==1 and a>meg:
        meg=a
print("Ο μεγαλύτερος περιττός είναι ο ", meg)
    










# Γράψτε ένα άλλο πρόγραμμα, το οποίο ζητά μια λίστα αριθμών, όπως και παραπάνω και στο τέλος εκτυπώνει το μέγιστο
# και το ελάχιστο όλων των αριθμών αντί για τον μέσο όρο.