# Φτιάξτε ένα λεξικό D το οποίο αντιστοιχίζει ονόματα (φοιτητών) στους
# βαθμούς τους (σε ένα συγκεκριμένο μάθημα). Τα δεδομένα θα διαβάζονται
# επαναληπτικά με την input. Η εισαγωγή δεδομένων θα τελειώνει όταν ο χρήστης
# εισάγει ως όνομα την λέξη end.
D = {}
while True:
    name = input("Give name: ")
    if name == 'end': break
    mark = float(input("Give mark:"))
    D[name] = mark
for k in D:
    print(D[k])



# Υποθέστε ότι σας δίνεται μία συμβολοσειρά και θέλετε να μετρήσετε
# πόσες φορές εμφανίζεται κάθε γράμμα. 

def histogram(s):
    d = dict()
    for c in s:
        if c not in d:
            d[c] = 1
        else:
            d[c] += 1
    return d

h= histogram(input("Δώσε συμβολοσειρά: "))
print(h)



# Μία από τις συνηθισμένες χρήσεις ενός λεξικού είναι να μετράει
# την εμφάνιση λέξεων σε ένα αρχείο, που περιέχει κείμενο.
fname = input('Εισαγάγετε το όνομα του αρχείου: ') 
try: 
    fhand = open(fname) 
except: 
    print('Δεν είναι δυνατό το άνοιγμα του αρχείου:', fname) 
    exit() 
 
πλήθη = dict() 
for γραμμή in fhand: 
    λέξεις = γραμμή.split() 
    for λέξη in λέξεις: 
        if λέξη not in πλήθη: 
            πλήθη[λέξη] = 1 
        else: 
            πλήθη[λέξη] += 1 
 
print(πλήθη) 

