# Να γίνει πρόγραμμα σε Python που:
# 1) Ζητάει από τον χρήστη ένα κείμενο (συμβολοσειρά) που αποτελείται από λέξεις.
# 2) Στη συνέχεια οι λέξεις μεταφέρονται μία μία σε μία λίστα. Θεωρούμε ότι μία λέξη τελείωσε όταν εντοπιστεί το κενό διάστημα " " ή ένας από τους χαρακτήρες ! , . : ; ? 
# 3) Να εμφανιστούν μία μία οι λέξεις που μεταφέρθηκαν στη λίστα.

Παρατήρηση: Οι χαρακτήρες ! , . : ; ? και το κενό διάστημα " " δεν μεταφέρονται στη λίστα, ακόμα κι αν υπάρχουν στη σειρά.


text=input('Δώσε ένα κέμενο. Το πρόγραμμα θα εμφανίσει τις λέξεις χωρίς τους χαρακτήρες:(! , . : ; ? και το κενό) :')
if text[-1]not in '!,.:;? ':
    text+='.'
words=[]
s=''
for i in text:
    if i not in '!,.:;? ':
        s+=i
    else:
        if s!='':
            words.append(s)
            s=''
for j in words:
    print(j)
