# Να γράψετε μια συνάρτηση σε Python η οποία θα δέχεται μια λέξη σε κεφαλαία και ελληνικά
# και θα επιστρέφει το πλήθος των φωνηέντων που έχει. Στη συνέχεια, να γράψετε μια δεύτερη συνάρτηση,
# η οποία θα δέχεται μια λίστα από λέξεις σε κεφαλαία και ελληνικά και θα επιστρέφει τη λέξη με τα περισσότερα φωνήεντα.

def vowels(s):
    v="ΑΕΗΙΟΥΩ"
    c=0
    for i in s:
        if i in v:
            c+=1
    return c
#----------------------------------------------------
def maxxv(L):
    maxx=vowels(L[0])
    maxxw=L[0]
    for j in L:
        c=vowels(j)
        if c>maxx:
            maxx=c
            maxxw=j
    return maxxw
#------------------------------------------------------
#παράδειγμα
lw=['ΚΑΛΗΜΕΡΑ','ΑΝΑΝΤΙΚΑΤΑΣΤΑΤΟ','ΠΑΡΑΠΟΙΗΣΗ','ΥΠΕΡΑΙΩΝΟΒΙΟ','ΑΝΤΙΣΤΟΙΧΟ','ΑΥΡΙΟ', 'ΑΑΑΑΑΑΑΑΑΑΑΑΑΑΑΑΑΑ']
print('Περισσότερα φωνήεντα:',maxxv(lw))
